export let arr = [
    {text:`Model-View-Controller (MVC, «Модель-Представление-Контроллер», «Модель-Вид-Контроллер») — схема разделения данных приложения,
            пользовательского интерфейса и управляющей логики на три отдельных компонента: модель, представление и контроллер — таким образом, что модификация каждого компонента может осуществляться независимо.
            Модель (Model) предоставляет данные и реагирует на команды контроллера, изменяя свое состояние .
            Представление (View) отвечает за отображение данных модели пользователю, реагируя на изменения модели.
            Контроллер (Controller) интерпретирует действия пользователя, оповещая модель о необходимости изменений.`
    },
    {
        text:`Одностраничное приложение (англ. single page application, SPA) — это веб-приложение или веб-сайт,
         использующий единственный HTML-документ как оболочку для всех веб-страниц и организующий взаимодействие 
         с пользователем через динамически подгружаемые HTML, CSS, JavaScript, обычно посредством AJAX.
        ОП напоминают родные (native) приложения, с той лишь разницей, что исполняются в рамках браузера,
         а не в собственном процессе операционной системы.`
    },
    {
        text:`Flux-архитектура — архитектурный подход или набор шаблонов программирования для построения пользовательского 
        интерфейса веб-приложений, сочетающийся с реактивным программированием и построенный на однонаправленных потоках данных.
        Согласно замыслу создателей и несмотря на то, что Facebook предоставил реализацию Flux в дополнение к React, 
        Flux не является ещё одним веб-фреймворком, а является архитектурным решением.`
    }
]
